// Цикл на кожній ітерації пропонує через prompt ввести число більше 100 (але максимум 10 ітерацій циклу). 
// Якщо відвідувач ввів число менше ста – попросити ввести ще раз, і таке інше. 
// Якщо користувач вводить більше ста, текст або цикл закінчує всі ітерації, 
// то функція виводить в консоль останній введення користувача і завершує функцію.


function numbers(){

for(let i = 0; i<10; i++){
  let num = prompt("Введіть число")
  if (+num>100){
    console.log("Ваше число більше ста:", num)
    break
  }
  }
}

numbers()